Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйБухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ФормаПроведенияПоБухгалтерскомуУчету/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Документ Из Параметры.Документы Цикл
	
		Если НЕ Документ.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Документ) + ": проведение по регистрам бухгалтерии возможно только для проведенного документа",,,, Отказ);
			Продолжить;
		КонецЕсли; 
		
		Если (ТипЗнч(Документ) = Тип("ДокументСсылка.НачислениеЗадолженности") 
			 ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.Оплата"))
			 	И БухгалтерскийУчет.ВидЗадолженностиСвязанСПартиями(Документ.ВидЗадолженности) Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Документ) + ": проведение по регистрам бухгалтерии возможно только для документов не затрагивающих партии",,,, Отказ);
			Продолжить;
		КонецЕсли;
		
		ЭтаФорма.Документы.Добавить(Документ);
		
		Если ЭтаФорма.ВидыУчета.Количество() = 3 Тогда // набрали все
			Продолжить;
		КонецЕсли;
		
		Для каждого Регистр Из Документ.Метаданные().Движения Цикл
			
			Если Метаданные.РегистрыБухгалтерии.Содержит(Регистр) Тогда
			
				Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыУчета.ЗначенияПеречисления Цикл
			
					Если Регистр.Имя = ЗначениеПеречисления.Имя 
						И ЭтаФорма.ВидыУчета.НайтиПоЗначению(Перечисления.ВидыУчета[ЗначениеПеречисления.Имя]) = Неопределено Тогда
					
						ЭтаФорма.ВидыУчета.Добавить(Перечисления.ВидыУчета[ЗначениеПеречисления.Имя],, Ложь);
					
					КонецЕсли; 
			
				КонецЦикла;
				
			КонецЕсли; 
		
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЭтаФорма.Документы.Количество() = 0 Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет документов для проведения",,,, Отказ);
		Возврат;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументВЗакрытомПериоде(СчетДоверительногоУправления, ВидУчета, ДокументДата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ИЗ
		|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|ГДЕ
		|	ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Проводки)
		|	И ДатыЗапретаРедактирования.ВидУчета = &ВидУчета
		|	И ДатыЗапретаРедактирования.ДатаЗапретаРедактирования >= &ДокументДата";
	
	Запрос.УстановитьПараметр("ВидУчета", ВидУчета);
	Запрос.УстановитьПараметр("ДокументДата", ДокументДата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат НЕ Запрос.Выполнить().Пустой()
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПровестиНаСервере(Документы, ВидыУчета, Отказ)
	
	ВидыУчетаДляПроведения = Новый Массив;
	
	Для каждого ВидУчета Из ВидыУчета Цикл
		Если ВидУчета.Пометка Тогда
			ВидыУчетаДляПроведения.Добавить(ВидУчета.Значение);
		КонецЕсли; 
	КонецЦикла;
	
	Если ВидыУчетаДляПроведения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ни один вид учета");
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДокументы Из Документы Цикл
		
		Документ = СтрокаДокументы.Значение;
		ДокументОбъект = Документ.ПолучитьОбъект();
		
		Для каждого ВидУчета Из ВидыУчета Цикл
			Если НЕ ВидУчета.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Отказ = Ложь;
			
			ВедетсяУчет = РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(Документ.Дата, Документ.Организация, Документ.СчетДоверительногоУправления, ВидУчета.Значение);
			Если НЕ ВедетсяУчет Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Документ) + ": не проводим т.к. на " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy") + " " + Строка(ВидУчета.Значение) + " не ведется.", , , , Отказ);
			ИначеЕсли ДокументВЗакрытомПериоде(Документ.СчетДоверительногоУправления, ВидУчета.Значение, НачалоДня(Документ.Дата)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Документ) + " находится в закрытом периоде и не будет проведен по " + Строка(ВидУчета.Значение), , , , Отказ);
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если ВидУчета.Значение = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
					ДокументОбъект.ПроведениеПоРегиструЕПС("ЕдиныйБухгалтерскийУчет", Отказ);
				Иначе
					ДокументОбъект.ПроведениеПоРегиструБухгалтерии(РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидУчета.Значение), Отказ);
				КонецЕсли;
				
				Для каждого Движение Из ДокументОбъект.Движения Цикл
					Если Движение.Записывать Тогда
						Движение.Записать();
					КонецЕсли;
				КонецЦикла;
			Исключение
			   	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Документ) + " не проведен по, " + Строка(ВидУчета.Значение) + " система сообщает: " + ОписаниеОшибки(), , , , Отказ);
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	Отказ = Ложь;
	ПровестиНаСервере(ЭтаФорма.Документы, ЭтаФорма.ВидыУчета, Отказ);
	Если НЕ Отказ Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры
